{
  "category": [
    {
      "id": 1,
      "name": "Star Wars"
    },
    {
      "id": 2,
      "name": "Consolas"
    },
    {
      "id": 3,
      "name": "Diversos"
    },
    {
      "name": "Steam",
      "id": 4
    }
  ],
  "products": [
    {
      "name": "Taza Stormtrooper",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/star-wars/taza.png",
      "description": "Esta hermosa taza presenta un dise침o detallado del casco de los Stormtroopers, soldados imperiales de la saga Star Wars. Fabricada en cer치mica de alta calidad, es perfecta para disfrutar de tus bebidas favoritas mientras revives las emocionantes batallas de la galaxia lejana.",
      "price": "56",
      "idcategory": 1,
      "id": 1
    },
    {
      "name": "Figuras de Darth Vader",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/star-wars/darth-vader.png",
      "description": "Un impresionante set de figuras coleccionables que representan al ic칩nico villano Darth Vader. Estas figuras detalladas son ideales para exhibir o como regalo para los fan치ticos de Star Wars. Revive la 칠pica saga de la lucha entre el bien y el mal con estas incre칤bles figuras.",
      "price": "57",
      "idcategory": 1,
      "id": 2
    },
    {
      "id": 3,
      "name": "Mu침eco Yoda",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/star-wars/doll.png",
      "description": "Un adorable mu침eco de peluche inspirado en el famoso maestro Jedi Yoda de Star Wars. Este suave y tierno compa침ero de peluche es perfecto para los fans de todas las edades. Con sus grandes orejas puntiagudas y sabidur칤a legendaria, este mu침eco Yoda traer치 alegr칤a a tu hogar y te recordar치 la fuerza y el poder del lado luminoso.",
      "price": "35",
      "idcategory": 1
    },
    {
      "id": 4,
      "name": "Traje Stormtrooper",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/star-wars/traje.png",
      "description": "Este impresionante traje de Stormtrooper te convertir치 en uno de los soldados de 칠lite del Imperio Gal치ctico. Confeccionado con materiales de alta calidad y detalles precisos, este traje es perfecto para fiestas tem치ticas de Star Wars, eventos de cosplay o para formar parte de un grupo de aficionados a la saga. Convi칠rtete en el ic칩nico s칤mbolo de la opresi칩n imperial y protege al Emperador a toda costa.",
      "price": "120",
      "idcategory": 1
    },
    {
      "id": 5,
      "name": "Yoda",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/star-wars/yoda.png",
      "description": "Una figura de colecci칩n de Yoda, uno de los personajes m치s queridos de Star Wars. Con su postura sabia y expresi칩n serena, esta figura captura perfectamente la esencia del maestro Jedi. Hecha con materiales de alta calidad, es un imprescindible para cualquier coleccionista de Star Wars. Que la fuerza te acompa침e.",
      "price": "20",
      "idcategory": 1
    },
    {
      "id": 6,
      "name": "Traje Palpatine",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/star-wars/palpatine.png",
      "description": "Este impresionante traje de Palpatine te permitir치 encarnar al malvado Emperador Palpatine de Star Wars. Confeccionado con materiales de alta calidad y detalles precisos, este traje te convertir치 en el siniestro manipulador detr치s de la ca칤da de la Rep칰blica y el ascenso del Imperio Gal치ctico. Perfecto para eventos de cosplay, fiestas tem치ticas de Star Wars y celebraciones de Halloween.",
      "price": "150",
      "idcategory": 1
    },
    {
      "id": 7,
      "name": "Mando Xbox",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/consolas/mando.png",
      "description": "Este mando de Xbox te brinda una experiencia de juego inigualable. Con su dise침o ergon칩mico y botones de respuesta r치pida, este mando es ideal para jugadores de todas las edades. Compatible con Xbox Series X/S, Xbox One y PC, este mando te permitir치 sumergirte en tus juegos favoritos y disfrutar de horas de diversi칩n.",
      "price": "50",
      "idcategory": 2
    },
    {
      "id": 8,
      "name": "Play Station 5",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/consolas/ps5.png",
      "description": "La consola PlayStation 5 es el 칰ltimo lanzamiento de Sony en la serie de consolas PlayStation. Con gr치ficos de 칰ltima generaci칩n, tiempos de carga ultrarr치pidos y un incre칤ble cat치logo de juegos, la PS5 ofrece una experiencia de juego incomparable. Descubre mundos asombrosos y sum칠rgete en aventuras 칠picas con esta potente consola de pr칩xima generaci칩n.",
      "price": "460",
      "idcategory": 2
    },
    {
      "id": 9,
      "name": "Consola Nintendo NES",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/consolas/nes.png",
      "description": "Revive la nostalgia de los videojuegos cl치sicos con la consola Nintendo Entertainment System (NES). Esta consola retro te permitir치 disfrutar de los juegos ic칩nicos de los a침os 80 y 90, como Super Mario Bros, The Legend of Zelda y Metroid. Conecta la NES a tu televisor y vuelve a experimentar la magia de los juegos de 8 bits con su ic칩nico control rectangular.",
      "price": "240",
      "idcategory": 2
    },
    {
      "id": 10,
      "name": "Nintendo Switch",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/consolas/switch.png",
      "description": "La Nintendo Switch es una consola h칤brida que te permite jugar tanto en la comodidad de tu hogar como en movimiento. Con sus Joy-Cons desmontables, puedes jugar solo o con amigos en el modo multijugador local. Adem치s de los juegos exclusivos de Nintendo, la Switch tambi칠n cuenta con un amplio cat치logo de t칤tulos de terceros para que disfrutes de una gran variedad de experiencias de juego.",
      "price": "420",
      "idcategory": 2
    },
    {
      "id": 11,
      "name": "Xbox",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/consolas/xbox.png",
      "description": "La consola Xbox ofrece una experiencia de juego de alta calidad con gr치ficos impresionantes y una amplia variedad de juegos exclusivos y populares. Con Xbox Game Pass, puedes acceder a una extensa biblioteca de juegos para descargar y jugar a trav칠s de una suscripci칩n mensual. Sum칠rgete en mundos virtuales asombrosos y disfruta de horas de diversi칩n con la consola Xbox.",
      "price": "400",
      "idcategory": 2
    },
    {
      "id": 12,
      "name": "Game Boy",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/consolas/game-boy.png",
      "description": "El Game Boy es una consola port치til cl치sica que marc칩 una era en la historia de los videojuegos. Lanzado por Nintendo en los a침os 90, esta ic칩nica consola en blanco y negro te permitir치 disfrutar de juegos retro y adictivos como Tetris, Super Mario Land y Pok칠mon. Con su dise침o compacto y bater칤a de larga duraci칩n, el Game Boy es perfecto para llevarlo contigo y revivir momentos nost치lgicos de tu infancia.",
      "price": "999",
      "idcategory": 2
    },
    {
      "id": 13,
      "name": "Camisa Atari",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/diversos/camisa-atari.png",
      "description": "Esta camisa con el ic칩nico logo de Atari es el regalo perfecto para los aficionados de los videojuegos cl치sicos. Confeccionada en algod칩n suave y c칩modo, esta camisa te permitir치 llevar contigo la nostalgia de la era dorada de los videojuegos. Haz una declaraci칩n de estilo y muestra tu pasi칩n por los juegos retro con esta elegante camisa.",
      "price": "36",
      "idcategory": 3
    },
    {
      "id": 14,
      "name": "Camisa Snes",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/diversos/camisa-snes.png",
      "description": "Celebra la legendaria consola Super Nintendo Entertainment System (SNES) con esta camisa retro. La SNES es famosa por su impresionante biblioteca de juegos y su impacto en la industria de los videojuegos. Lleva contigo la nostalgia de los cl치sicos como Super Mario World, The Legend of Zelda: A Link to the Past y muchos m치s con esta camisa de estilo vintage.",
      "price": "57",
      "idcategory": 3
    },
    {
      "id": 15,
      "name": "Mu침eco Sonic",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/diversos/sonic.png",
      "description": "Este mu침eco de Sonic, el famoso erizo azul de SEGA, es una adici칩n imprescindible para cualquier fan치tico de los videojuegos. Con su actitud audaz y su ic칩nico dise침o, Sonic ha sido un personaje querido por generaciones. Este mu침eco captura perfectamente la esencia del h칠roe veloz y te recordar치 las emocionantes aventuras en Green Hill Zone y m치s all치.",
      "price": "15",
      "idcategory": 3
    },
    {
      "id": 16,
      "name": "Reloj Digital",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/diversos/relog.png",
      "description": "Este reloj digital es el accesorio perfecto para los fan치ticos de los videojuegos retro. Con su dise침o inspirado en los gr치ficos pixelados de los juegos cl치sicos, este reloj te permitir치 llevar contigo la nostalgia de los viejos tiempos. Adem치s de mostrar la hora, el reloj tambi칠n incluye funciones como cron칩metro y alarma, siendo un compa침ero 칰til y elegante para el d칤a a d칤a.",
      "price": "24",
      "idcategory": 3
    },
    {
      "id": 17,
      "name": "Gafas Virtuales",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/diversos/gafas.png",
      "description": "Sum칠rgete en la realidad virtual con estas impresionantes gafas. Con su dise침o ergon칩mico y tecnolog칤a avanzada, estas gafas te permitir치n vivir experiencias de juego y entretenimiento inmersivas como nunca antes. Explora mundos virtuales, participa en emocionantes juegos y disfruta de pel칤culas en 3D con estas gafas de realidad virtual de alta calidad.",
      "price": "820",
      "idcategory": 3
    },
    {
      "name": "Pikachu",
      "img": "https://raw.githubusercontent.com/molinalk/AluraGeek/main/img/diversos/pikachu.png",
      "description": "Este adorable peluche de Pikachu, el famoso Pok칠mon el칠ctrico, es un compa침ero ideal para los amantes de Pok칠mon. Con sus mejillas sonrojadas y su car치cter encantador, este peluche captura la esencia del querido personaje. Lleva contigo la magia del mundo Pok칠mon y deja que Pikachu ilumine tu d칤a con su energ칤a y encanto.",
      "price": "24",
      "idcategory": 3,
      "id": 18
    },
    {
      "name": "Sekirito Goty de toda la vida",
      "img": "https://cdn.akamai.steamstatic.com/steam/apps/814380/capsule_616x353.jpg?t=1678991267",
      "description": "Este juegot es goty",
      "price": "100",
      "idcategory": 4,
      "id": 19
    },
    {
      "name": "hollow knight",
      "img": "https://images.squarespace-cdn.com/content/v1/606d159a953867291018f801/1619987722169-VV6ZASHHZNRBJW9X0PLK/Key_Art_02_layeredjpg.jpg?format=1500w",
      "description": "Tremendo juego el del cascaron vacio, una obra maestra 20/10 y goty",
      "price": "24",
      "idcategory": 4,
      "id": 20
    },
    {
      "name": "Dark Shouls",
      "img": "https://image.api.playstation.com/cdn/EP0700/CUSA08495_00/COYF3JBI46ftkG7tIdTjQg0v9aZ2378N.png",
      "description": "Este jeugo de Dark Shouls Remastered es una carta de amor a los videojuegos, Tremendo juego 游游",
      "price": "59",
      "idcategory": 4,
      "id": 21
    }
  ]
}